Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/income_tax_credits_and_reliefs/index.html.txt.tmx
Source language: en
Languages: ga

source: Income tax credits and reliefs
ga: Creidmheasanna agus faoiseamh cáin ioncaim

source: Overview Document Introduction to income tax credits and reliefs Tax reliefs reduce the amount of tax that you have to pay
ga: Overview Document Réamhrá ar chreidmheasanna cánach agus faoiseamh ó cháin ioncaim Laghdaíonn faoiseamh cánach an méid cánach a bhíonn ort a íoc

source: Find out about the different types of income tax relief that apply to your circumstances
ga: Faigh amach faoi chineálacha difriúla na bhfaoiseamh ó cháin ioncaim in Éirinn a bhaineann le do chúinsí

source: Taxation and medical expenses
ga: Cáin agus costais leighis

source: Tax relief is available for private health and long term care insurance. It is also available for certain medical expenses
ga: Tá cur síos anseo ar an bhfaoiseamh cánach atá ar fáil ar chostas a bhaineann le hárachas sláinte agus árachas don chúram fadthéarmach agus ar chostais leighis

source: Special taxation arrangements apply to people aged 65 and over
ga: Cáin do dhaoine atá ós cionn 65

source: Separation, divorce and income tax credits and reliefs
ga: Scaradh, colscaradh agus creidmheasanna agus faoiseamh cáin ioncaim

source: A description of how income and maintenance is taxed after separation or divorce
ga: Cur síos mion ar na rialacha a bhaineann le cáin ioncaim tar éis scartha/colscartha

source: This document discusses the tax treatment of maintenance payments made by one spouse to another
ga: Déantar íocaíochtaí cothabhála ó chéile amháin go céile eile a phlé anseo ó thaobh cúrsaí cánacha

source: Income tax credits and reliefs following a death
ga: Creidmheasanna agus faoiseamh cánach ioncaim tar éis báis

source: A brief summary of the tax treatment of unmarried and widowed people in the year of death
ga: Réamhrá gairid den cháin a ghearrtar ar daoine nach bhfuil pósta agus daoine ar baintreacha/baintreacha fir iad sa bhliain a fhaigheann duine den lánúin bás

source: An outline of tax treatment of married couples in the year of death of one spouse is also included
ga: Tá cuntas san áireamh ar an gcaoi a gcaitear ó thaobh cáin de le lánúin phósta sa bhliain a fhaigheann duine den lánúin bás

source: Employment tax credits and reliefs
ga: Creidmheasanna agus faoisimh chánach fostaíochta

source: There are a number of tax credits and reliefs available to those in employment
ga: Tá roinnt creidmheasanna agus faoisimh chánach ar fáil dóibh siud atá fostaithe in Éirinn

source: Find out how are items such as benefit-in-kind treated for tax purposes
ga: An bhfuil tú ag éileamh do chreidmheasanna cánach go léir agus conas a mheastar míreanna cosúil le sochar comhchineáil le haghaidh cúrsaí cánach?

source: Single Person Child Carer Credit
ga: An Creidmheas Cánach Cúramóra Linbh do Dhuine Singil

source: The Single Person Child Carer Credit (SPCCC) is a tax credit for people who are caring for children on their own
ga: Is é atá sa Chreidmheas Cánach Cúramóra Linbh do Dhuine Singil (CCCLDS) ná creidmheas cánach do dhaoine atá ag tabhairt aire do leanaí ina n-aonar

source: It replaced the One-Parent Family Credit from 1 January 2014
ga: Tógadh é isteach in ionad an Chreidmheasa Cánach Teaghlaigh Aon-Tuismitheora (CCTAT) ón 1 Eanáir 2014

source: Housing tax credits and reliefs
ga: Faoisimh agus creidmheasanna cánach i leith tithíochta

source: It is possible to claim tax relief on certain housing expenses. Find out more
ga: Féadfar faoiseamh cánach a éileamh ar réimse chostais tí

source: Tax credits and reliefs for people with disabilities
ga: Creidmheasanna agus faoiseamh do dhaoine míchumasaithe

source: This document is in: Money and Tax > Tax
ga: This document is in: Airgead agus Cáin > Cáin

source: Tax relief for third-level fees
ga: Faoiseamh cánach ar tháillí don tríú leibhéal

source: Tax relief is available in respect of tuition fees paid in private third-level institutions, in institutions abroad and by repeat students and part-time students. The Student Contribution may also qualify for relief
ga: Cur síos ar an bhfaoiseamh cánach atá le fáil ar tháillí a íoctar le hinstitiúidí príobháideacha tríú leibhéal, le hinstitiúidí thar lear, ag mic léinn atá ag athdhéanamh scrúduithe agus ag mic léinn páirt-aimseartha

source: This document is in: Education and Training > Third-level education > Fees and supports for third-level education
ga: This document is in: Oideachas agus Oiliúint > Oideachas tríú leibhéil > Táillí agus Tacaíocht do mhic léinn tríú leibhéil

source: Revenue Job Assist is an additional tax allowance for people who have been unemployed for 12 months or more and are returning to employment
ga: Is faoiseamh breise cánach é Postchúnamh Ioncaim do dhaoine a bhí dífhostaithe ar feadh 12 mhí nó níos mó agus atá ag filleadh ar fhostaíocht

source: This document is in: Employment > Unemployment and redundancy > Employment support schemes
ga: This document is in: Fostaíocht > Dífhostaíocht agus Iomarcaíocht > Scéimeanna Tacaíochta Fostaíochta

source: A deed of covenant is a legally binding agreement made by an individual to pay an agreed amount to someone else without receiving any benefit in return
ga: Is aontas dlithiúil é gníomhas cúnaint a dhéanann duine go n-íocfaidh sé/sí méid áirithe airgid le huine eile gan tairbhe ar bith a fháil ar ais

source: Home Carer's Tax Credit
ga: Creidmheas Cánach do Chúramóirí Baile

source: Married couples or civil partners may be entitled to claim this credit if one spouse or civil partner works in the home caring for a dependent person
ga: Is féidir le cúplaí pósta a bheith i dteideal an creidmheas seo a éileamh má tá céile amháin ag obair sa bhaile ag tabhairt cúraim do dhuine cleithiúnach

source: Cycle to Work Scheme
ga: An Scéim um Rothaíocht chun na hOibre

source: The Cycle to Work Scheme allows an employer to buy a new bicycle and bicycle safety equipment up to a value of €1,000 for employees
ga: Cuireann an Scéim um Rothaíocht chun na hOibre ar a c(h)umas ag fostóir rothar nua agus trealamh sábháilteachta rothair a cheannach d'fhostaithe suas go dtí €1,000

source: Employees can then repay the purchase cost to their employer from their gross salary
ga: Is féidir le fostaithe an costas ceannaigh a aisíoc chuig a bhfostóir óna n-ollchaiteachas

source: Start Your Own Business Relief
ga: Faoiseamh chun do Ghnólacht Féin a Thosú

source: Most Read in "Money and Tax"
ga: Ábhar is mó éilimh i "Airgead agus Cáin"

source: How your income tax is calculated
ga: An córas le cáin a mheas
